Revit 2026 API

# ArcCreate(Plane, Double, Double, Double) Method

---

Creates a new geometric arc object based on plane, radius, and angles.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Arc Create(
	Plane plane,
	double radius,
	double startAngle,
	double endAngle
)
```
```vb
Public Shared Function Create (
	plane As Plane,
	radius As Double,
	startAngle As Double,
	endAngle As Double
) As Arc
```
```cpp
public:
static Arc^ Create(
	Plane^ plane,
	double radius,
	double startAngle,
	double endAngle
)
```
```fsharp
static member Create :
        plane : Plane *
        radius : float *
        startAngle : float *
        endAngle : float -> Arc
```

#### Parameters

plane Plane
     The plane which the arc resides. The plane's origin is the center of the arc.
radius Double
     The radius of the arc.
startAngle Double
     The start angle of the arc (in radians).
endAngle Double
     The end angle of the arc (in radians).

#### Return Value

Arc The new arc.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was NULL |
| ArgumentOutOfRangeException | The given value for radius must be greater than 0 and no more than 30000 feet. |
| ArgumentsInconsistentException | Start angle must be less than end angle. -or- Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance). |

If the angle range is equal to or greater than 2 * PI, the curve will be automatically converted to an unbounded circle.

#### Reference

Arc Class

Create Overload

Autodesk.Revit.DB Namespace